#pragma pack(push, 1)

// Структура GameObject (из дампа IDA)
// Размер: 0x1C8 (456 байт)
// Полей: 71
struct GameObject {
    char field_0[4];           // 0x0000
    char field_4[4];           // 0x0004
    char field_8[4];           // 0x0008
    char field_C[4];           // 0x000C
    char field_10[4];          // 0x0010
    char field_14[4];          // 0x0014
    char field_18[4];          // 0x0018
    char field_1C[4];          // 0x001C
    char field_20[4];          // 0x0020
    char field_24[4];          // 0x0024
    char field_28[4];          // 0x0028
    char field_2C[4];          // 0x002C
    char field_30[4];          // 0x0030
    char field_34[4];          // 0x0034
    char field_38[4];          // 0x0038
    char field_3C[4];          // 0x003C
    char field_40[4];          // 0x0040
    char field_44[4];          // 0x0044
    char field_48[4];          // 0x0048
    char field_4C[4];          // 0x004C
    char field_50[4];          // 0x0050
    char field_54[4];          // 0x0054
    char field_58[4];          // 0x0058
    char field_5C[4];          // 0x005C
    char field_60[4];          // 0x0060
    char field_64[4];          // 0x0064
    char field_68[4];          // 0x0068
    char field_6C[4];          // 0x006C
    char field_70[4];          // 0x0070
    char field_74[4];          // 0x0074
    char field_78[4];          // 0x0078
    char field_7C[4];          // 0x007C
    char field_80[4];          // 0x0080
    char field_84[4];          // 0x0084
    char field_88[4];          // 0x0088
    char field_8C[4];          // 0x008C
    char field_90[4];          // 0x0090
    char field_94[4];          // 0x0094
    char field_98[4];          // 0x0098
    char field_9C[4];          // 0x009C
    char field_A0[4];          // 0x00A0
    char field_A4[4];          // 0x00A4
    char field_A8[4];          // 0x00A8
    char field_AC[4];          // 0x00AC
    char field_B0[4];          // 0x00B0
    char field_B4[4];          // 0x00B4
    char field_B8[4];          // 0x00B8
    char field_BC[4];          // 0x00BC
    char field_C0[4];          // 0x00C0
    char field_C4[4];          // 0x00C4
    char field_C8[4];          // 0x00C8
    char field_CC[4];          // 0x00CC
    char field_D0[4];          // 0x00D0
    char field_D4[4];          // 0x00D4
    char field_D8[4];          // 0x00D8
    char field_DC[4];          // 0x00DC
    char field_E0[4];          // 0x00E0
    char field_E4[4];          // 0x00E4
    char field_E8[4];          // 0x00E8
    char field_EC[4];          // 0x00EC
    char field_F0[4];          // 0x00F0
    char field_F4[4];          // 0x00F4
    char field_F8[4];          // 0x00F8
    char field_FC[4];          // 0x00FC
    char field_100[4];         // 0x0100
    char field_104[4];         // 0x0104
    char field_108[4];         // 0x0108
    char field_10C[4];         // 0x010C
    char field_110[4];         // 0x0110
    char field_114[4];         // 0x0114
    char field_118[4];         // 0x0118
    char field_11C[4];         // 0x011C
    char field_120[4];         // 0x0120
    char field_124[4];         // 0x0124
    char field_128[4];         // 0x0128
    char field_12C[4];         // 0x012C
    char field_130[4];         // 0x0130
    char field_134[4];         // 0x0134
    char field_138[4];         // 0x0138
    char field_13C[4];         // 0x013C
    char field_140[4];         // 0x0140
    char field_144[4];         // 0x0144
    char field_148[4];         // 0x0148
    char field_14C[4];         // 0x014C
    char field_150[4];         // 0x0150
    char field_154[4];         // 0x0154
    char field_158[4];         // 0x0158
    char field_15C[4];         // 0x015C
    char field_160[4];         // 0x0160
    char field_164[4];         // 0x0164
    char field_168[4];         // 0x0168
    char field_16C[4];         // 0x016C
    char field_170[4];         // 0x0170
    char field_174[4];         // 0x0174
    char field_178[4];         // 0x0178
    char field_17C[4];         // 0x017C
    char field_180[4];         // 0x0180
    char field_184[4];         // 0x0184
    char field_188[4];         // 0x0188
    char field_18C[4];         // 0x018C
    char field_190[4];         // 0x0190
    char field_194[4];         // 0x0194
    char field_198[4];         // 0x0198
    char field_19C[4];         // 0x019C
    char field_1A0[4];         // 0x01A0
    char field_1A4[4];         // 0x01A4
    char field_1A8[4];         // 0x01A8
    char field_1AC[4];         // 0x01AC
    char field_1B0[4];         // 0x01B0
    char field_1B4[4];         // 0x01B4
    char field_1B8[4];         // 0x01B8
    char field_1BC[4];         // 0x01BC
    char field_1C0[4];         // 0x01C0
    char field_1C4[4];         // 0x01C4
};
#pragma pack(pop)

static_assert(sizeof(GameObject) == 0x1C8, "GameObject size must be 0x1C8");
