#ifndef PED_H
#define PED_H

#include <windows.h>
// TODO: Добавить подключения других структур по мере их создания
// #include "Player.h"
// #include "Car.h"
// #include "GameObject.h"
// #include "Weapon.h"
// #include "Gang.h"
// #include "S200.h"
// #include "S169.h"
// #include "S94.h"

#pragma pack(push, 1)

struct Ped {
    // Поля структуры Ped из дампа IDA (всего 225 полей)
    // Примечание: Типы и имена взяты напрямую из дизассемблированного кода
    
    char field_0[4];             // 0x0000
    char field_4[4];             // 0x0004
    char field_8[4];             // 0x0008
    char field_C[4];             // 0x000C
    char field_10[4];            // 0x0010
    char field_14[4];            // 0x0014
    char field_18[4];            // 0x0018
    char field_1C[4];            // 0x001C
    char field_20[4];            // 0x0020
    char field_24[4];            // 0x0024
    char field_28[4];            // 0x0028
    char field_2C[4];            // 0x002C
    char field_30[4];            // 0x0030
    char field_34[4];            // 0x0034
    char field_38[4];            // 0x0038
    char field_3C[4];            // 0x003C
    char field_40[4];            // 0x0040
    char field_44[4];            // 0x0044
    char field_48[4];            // 0x0048
    char field_4C[4];            // 0x004C
    char field_50[4];            // 0x0050
    char field_54[4];            // 0x0054
    char field_58[4];            // 0x0058
    char field_5C[4];            // 0x005C
    char field_60[4];            // 0x0060
    char field_64[4];            // 0x0064
    char field_68[4];            // 0x0068
    char field_6C[4];            // 0x006C
    char field_70[4];            // 0x0070
    char field_74[4];            // 0x0074
    char field_78[4];            // 0x0078
    char field_7C[4];            // 0x007C
    char field_80[4];            // 0x0080
    char field_84[4];            // 0x0084
    char field_88[4];            // 0x0088
    char field_8C[4];            // 0x008C
    char field_90[4];            // 0x0090
    char field_94[4];            // 0x0094
    char field_98[4];            // 0x0098
    char field_9C[4];            // 0x009C
    char field_A0[4];            // 0x00A0
    char field_A4[4];            // 0x00A4
    char field_A8[4];            // 0x00A8
    char field_AC[4];            // 0x00AC
    char field_B0[4];            // 0x00B0
    char field_B4[4];            // 0x00B4
    char field_B8[4];            // 0x00B8
    char field_BC[4];            // 0x00BC
    char field_C0[4];            // 0x00C0
    char field_C4[4];            // 0x00C4
    char field_C8[4];            // 0x00C8
    char field_CC[4];            // 0x00CC
    char field_D0[4];            // 0x00D0
    char field_D4[4];            // 0x00D4
    char field_D8[4];            // 0x00D8
    char field_DC[4];            // 0x00DC
    char field_E0[4];            // 0x00E0
    char field_E4[4];            // 0x00E4
    char field_E8[4];            // 0x00E8
    char field_EC[4];            // 0x00EC
    char field_F0[4];            // 0x00F0
    char field_F4[4];            // 0x00F4
    char field_F8[4];            // 0x00F8
    char field_FC[4];            // 0x00FC
    char field_100[4];           // 0x0100
    char field_104[4];           // 0x0104
    char field_108[4];           // 0x0108
    char field_10C[4];           // 0x010C
    char field_110[4];           // 0x0110
    char field_114[4];           // 0x0114
    char field_118[4];           // 0x0118
    char field_11C[4];           // 0x011C
    char field_120[4];           // 0x0120
    char field_124[4];           // 0x0124
    char field_128[4];           // 0x0128
    char field_12C[4];           // 0x012C
    char field_130[4];           // 0x0130
    char field_134[4];           // 0x0134
    char field_138[4];           // 0x0138
    char field_13C[4];           // 0x013C
    char field_140[4];           // 0x0140
    char field_144[4];           // 0x0144
    char field_148[4];           // 0x0148
    char field_14C[4];           // 0x014C
    char field_150[4];           // 0x0150
    char field_154[4];           // 0x0154
    char field_158[4];           // 0x0158
    char field_15C[4];           // 0x015C
    char field_160[4];           // 0x0160
    char field_164[4];           // 0x0164
    char field_168[4];           // 0x0168
    char field_16C[4];           // 0x016C
    char field_170[4];           // 0x0170
    char field_174[4];           // 0x0174
    char field_178[4];           // 0x0178
    char field_17C[4];           // 0x017C
    char field_180[4];           // 0x0180
    char field_184[4];           // 0x0184
    char field_188[4];           // 0x0188
    char field_18C[4];           // 0x018C
    char field_190[4];           // 0x0190
    char field_194[4];           // 0x0194
    char field_198[4];           // 0x0198
    char field_19C[4];           // 0x019C
    char field_1A0[4];           // 0x01A0
    char field_1A4[4];           // 0x01A4
    char field_1A8[4];           // 0x01A8
    char field_1AC[4];           // 0x01AC
    char field_1B0[4];           // 0x01B0
    char field_1B4[4];           // 0x01B4
    char field_1B8[4];           // 0x01B8
    char field_1BC[4];           // 0x01BC
    char field_1C0[4];           // 0x01C0
    char field_1C4[4];           // 0x01C4
    char field_1C8[4];           // 0x01C8
    char field_1CC[4];           // 0x01CC
    char field_1D0[4];           // 0x01D0
    char field_1D4[4];           // 0x01D4
    char field_1D8[4];           // 0x01D8
    char field_1DC[4];           // 0x01DC
    char field_1E0[4];           // 0x01E0
    char field_1E4[4];           // 0x01E4
    char field_1E8[4];           // 0x01E8
    char field_1EC[4];           // 0x01EC
    char field_1F0[4];           // 0x01F0
    char field_1F4[4];           // 0x01F4
    char field_1F8[4];           // 0x01F8
    char field_1FC[4];           // 0x01FC
    char field_200[4];           // 0x0200
    char field_204[4];           // 0x0204
    char field_208[4];           // 0x0208
    char field_20C[4];           // 0x020C
    char field_210[4];           // 0x0210
    char field_214[4];           // 0x0214
    char field_218[4];           // 0x0218
    char field_21C[4];           // 0x021C
    char field_220[4];           // 0x0220
    char field_224[4];           // 0x0224
    char field_228[4];           // 0x0228
    char field_22C[4];           // 0x022C
    char field_230[4];           // 0x0230
    char field_234[4];           // 0x0234
    char field_238[4];           // 0x0238
    char field_23C[4];           // 0x023C
    char field_240[4];           // 0x0240
    char field_244[4];           // 0x0244
    char field_248[4];           // 0x0248
    char field_24C[4];           // 0x024C
    char field_250[4];           // 0x0250
    char field_254[4];           // 0x0254
    char field_258[4];           // 0x0258
    char field_25C[4];           // 0x025C
    char field_260[4];           // 0x0260
    char field_264[4];           // 0x0264
    char field_268[4];           // 0x0268
    char field_26C[4];           // 0x026C
    char field_270[4];           // 0x0270
    char field_274[4];           // 0x0274
    char field_278[4];           // 0x0278
    char field_27C[4];           // 0x027C
    char field_280[4];           // 0x0280
    char field_284[4];           // 0x0284
    char field_288[4];           // 0x0288
    char field_28C[4];           // 0x028C
    char field_290[4];           // 0x0290
    char field_294[4];           // 0x0294
    char field_298[4];           // 0x0298
    char field_29C[4];           // 0x029C
    char field_2A0[4];           // 0x02A0
    char field_2A4[4];           // 0x02A4
    char field_2A8[4];           // 0x02A8
    char field_2AC[4];           // 0x02AC
    char field_2B0[4];           // 0x02B0
    char field_2B4[4];           // 0x02B4
    char field_2B8[4];           // 0x02B8
    char field_2BC[4];           // 0x02BC
    char field_2C0[4];           // 0x02C0
    char field_2C4[4];           // 0x02C4
    char field_2C8[4];           // 0x02C8
    char field_2CC[4];           // 0x02CC
    char field_2D0[4];           // 0x02D0
    char field_2D4[4];           // 0x02D4
    char field_2D8[4];           // 0x02D8
    char field_2DC[4];           // 0x02DC
    char field_2E0[4];           // 0x02E0
    char field_2E4[4];           // 0x02E4
    char field_2E8[4];           // 0x02E8
    char field_2EC[4];           // 0x02EC
    char field_2F0[4];           // 0x02F0
    char field_2F4[4];           // 0x02F4
    char field_2F8[4];           // 0x02F8
    char field_2FC[4];           // 0x02FC
    char field_300[4];           // 0x0300
    char field_304[4];           // 0x0304
    char field_308[4];           // 0x0308
    char field_30C[4];           // 0x030C
    char field_310[4];           // 0x0310
    char field_314[4];           // 0x0314
    char field_318[4];           // 0x0318
    char field_31C[4];           // 0x031C
    char field_320[4];           // 0x0320
    char field_324[4];           // 0x0324
    char field_328[4];           // 0x0328
    char field_32C[4];           // 0x032C
    char field_330[4];           // 0x0330
    char field_334[4];           // 0x0334
    char field_338[4];           // 0x0338
    char field_33C[4];           // 0x033C
    char field_340[4];           // 0x0340
    char field_344[4];           // 0x0344
    char field_348[4];           // 0x0348
    char field_34C[4];           // 0x034C
    char field_350[4];           // 0x0350
    char field_354[4];           // 0x0354
    char field_358[4];           // 0x0358
    char field_35C[4];           // 0x035C
    char field_360[4];           // 0x0360
    char field_364[4];           // 0x0364
    char field_368[4];           // 0x0368
    char field_36C[4];           // 0x036C
    char field_370[4];           // 0x0370
    char field_374[4];           // 0x0374
    char field_378[4];           // 0x0378
    char field_37C[4];           // 0x037C
    char field_380[4];           // 0x0380
    char field_384[4];           // 0x0384
    char field_388[4];           // 0x0388
    char field_38C[4];           // 0x038C
    char field_390[4];           // 0x0390
    char field_394[4];           // 0x0394
    char field_398[4];           // 0x0398
    char field_39C[4];           // 0x039C
    char field_3A0[4];           // 0x03A0
    char field_3A4[4];           // 0x03A4
    char field_3A8[4];           // 0x03A8
    char field_3AC[4];           // 0x03AC
    char field_3B0[4];           // 0x03B0
    char field_3B4[4];           // 0x03B4
    char field_3B8[4];           // 0x03B8
    char field_3BC[4];           // 0x03BC
    char field_3C0[4];           // 0x03C0
    char field_3C4[4];           // 0x03C4
    char field_3C8[4];           // 0x03C8
    char field_3CC[4];           // 0x03CC
    char field_3D0[4];           // 0x03D0
    char field_3D4[4];           // 0x03D4
    char field_3D8[4];           // 0x03D8
    char field_3DC[4];           // 0x03DC
    char field_3E0[4];           // 0x03E0
    char field_3E4[4];           // 0x03E4
    char field_3E8[4];           // 0x03E8
    char field_3EC[4];           // 0x03EC
    char field_3F0[4];           // 0x03F0
    char field_3F4[4];           // 0x03F4
    char field_3F8[4];           // 0x03F8
    char field_3FC[4];           // 0x03FC
    char field_400[4];           // 0x0400
    char field_404[4];           // 0x0404
    char field_408[4];           // 0x0408
    char field_40C[4];           // 0x040C
    char field_410[4];           // 0x0410
    char field_414[4];           // 0x0414
    char field_418[4];           // 0x0418
    char field_41C[4];           // 0x041C
    char field_420[4];           // 0x0420
    char field_424[4];           // 0x0424
    char field_428[4];           // 0x0428
    char field_42C[4];           // 0x042C
    char field_430[4];           // 0x0430
    char field_434[4];           // 0x0434
    char field_438[4];           // 0x0438
    char field_43C[4];           // 0x043C
    char field_440[4];           // 0x0440
    char field_444[4];           // 0x0444
    char field_448[4];           // 0x0448
    char field_44C[4];           // 0x044C
    char field_450[4];           // 0x0450
    char field_454[4];           // 0x0454
    char field_458[4];           // 0x0458
    char field_45C[4];           // 0x045C
    char field_460[4];           // 0x0460
    char field_464[4];           // 0x0464
    char field_468[4];           // 0x0468
    char field_46C[4];           // 0x046C
    char field_470[4];           // 0x0470
    char field_474[4];           // 0x0474
    char field_478[4];           // 0x0478
    char field_47C[4];           // 0x047C
    char field_480[4];           // 0x0480
    char field_484[4];           // 0x0484
    char field_488[4];           // 0x0488
    char field_48C[4];           // 0x048C
    char field_490[4];           // 0x0490
    char field_494[4];           // 0x0494
    char field_498[4];           // 0x0498
    char field_49C[4];           // 0x049C
    char field_4A0[4];           // 0x04A0
    char field_4A4[4];           // 0x04A4
    char field_4A8[4];           // 0x04A8
    char field_4AC[4];           // 0x04AC
    char field_4B0[4];           // 0x04B0
    char field_4B4[4];           // 0x04B4
    char field_4B8[4];           // 0x04B8
    char field_4BC[4];           // 0x04BC
    char field_4C0[4];           // 0x04C0
    char field_4C4[4];           // 0x04C4
    char field_4C8[4];           // 0x04C8
    char field_4CC[4];           // 0x04CC
    char field_4D0[4];           // 0x04D0
    char field_4D4[4];           // 0x04D4
    char field_4D8[4];           // 0x04D8
    char field_4DC[4];           // 0x04DC
    char field_4E0[4];           // 0x04E0
    char field_4E4[4];           // 0x04E4
    char field_4E8[4];           // 0x04E8
    char field_4EC[4];           // 0x04EC
    char field_4F0[4];           // 0x04F0
    char field_4F4[4];           // 0x04F4
    char field_4F8[4];           // 0x04F8
    char field_4FC[4];           // 0x04FC
    char field_500[4];           // 0x0500
    char field_504[4];           // 0x0504
    char field_508[4];           // 0x0508
    char field_50C[4];           // 0x050C
    char field_510[4];           // 0x0510
    char field_514[4];           // 0x0514
    char field_518[4];           // 0x0518
    char field_51C[4];           // 0x051C
    char field_520[4];           // 0x0520
    char field_524[4];           // 0x0524
    char field_528[4];           // 0x0528
    char field_52C[4];           // 0x052C
    char field_530[4];           // 0x0530
    char field_534[4];           // 0x0534
    char field_538[4];           // 0x0538
    char field_53C[4];           // 0x053C
    char field_540[4];           // 0x0540
    char field_544[4];           // 0x0544
    char field_548[4];           // 0x0548
    char field_54C[4];           // 0x054C
    char field_550[4];           // 0x0550
    char field_554[4];           // 0x0554
    char field_558[4];           // 0x0558
    char field_55C[4];           // 0x055C
    char field_560[4];           // 0x0560
    char field_564[4];           // 0x0564
    char field_568[4];           // 0x0568
    char field_56C[4];           // 0x056C
    char field_570[4];           // 0x0570
    char field_574[4];           // 0x0574
    char field_578[4];           // 0x0578
    char field_57C[4];           // 0x057C
    char field_580[4];           // 0x0580
    char field_584[4];           // 0x0584
    char field_588[4];           // 0x0588
    char field_58C[4];           // 0x058C
    char field_590[4];           // 0x0590
    char field_594[4];           // 0x0594
    char field_598[4];           // 0x0598
    char field_59C[4];           // 0x059C
    char field_5A0[4];           // 0x05A0
    char field_5A4[4];           // 0x05A4
    char field_5A8[4];           // 0x05A8
    char field_5AC[4];           // 0x05AC
    char field_5B0[4];           // 0x05B0
    char field_5B4[4];           // 0x05B4
    char field_5B8[4];           // 0x05B8
    char field_5BC[4];           // 0x05BC
    char field_5C0[4];           // 0x05C0
    char field_5C4[4];           // 0x05C4
    char field_5C8[4];           // 0x05C8
    char field_5CC[4];           // 0x05CC
    char field_5D0[4];           // 0x05D0
    char field_5D4[4];           // 0x05D4
    char field_5D8[4];           // 0x05D8
    char field_5DC[4];           // 0x05DC
    char field_5E0[4];           // 0x05E0
    char field_5E4[4];           // 0x05E4
    char field_5E8[4];           // 0x05E8
    char field_5EC[4];           // 0x05EC
    char field_5F0[4];           // 0x05F0
    char field_5F4[4];           // 0x05F4
    char field_5F8[4];           // 0x05F8
    char field_5FC[4];           // 0x05FC
    char field_600[4];           // 0x0600
    char field_604[4];           // 0x0604
    char field_608[4];           // 0x0608
    char field_60C[4];           // 0x060C
    char field_610[4];           // 0x0610
    char field_614[4];           // 0x0614
    char field_618[4];           // 0x0618
    char field_61C[4];           // 0x061C
    char field_620[4];           // 0x0620
    char field_624[4];           // 0x0624
    char field_628[4];           // 0x0628
    char field_62C[4];           // 0x062C
    char field_630[4];           // 0x0630
    char field_634[4];           // 0x0634
    char field_638[4];           // 0x0638
    char field_63C[4];           // 0x063C
    char field_640[4];           // 0x0640
    char field_644[4];           // 0x0644
    char field_648[4];           // 0x0648
    char field_64C[4];           // 0x064C
    char field_650[4];           // 0x0650
    char field_654[4];           // 0x0654
    char field_658[4];           // 0x0658
    char field_65C[4];           // 0x065C
    char field_660[4];           // 0x0660
    char field_664[4];           // 0x0664
    char field_668[4];           // 0x0668
    char field_66C[4];           // 0x066C
    char field_670[4];           // 0x0670
    char field_674[4];           // 0x0674
    char field_678[4];           // 0x0678
    char field_67C[4];           // 0x067C
    char field_680[4];           // 0x0680
    char field_684[4];           // 0x0684
    char field_688[4];           // 0x0688
    char field_68C[4];           // 0x068C
    char field_690[4];           // 0x0690
    char field_694[4];           // 0x0694
    char field_698[4];           // 0x0698
    char field_69C[4];           // 0x069C
    char field_6A0[4];           // 0x06A0
    char field_6A4[4];           // 0x06A4
    char field_6A8[4];           // 0x06A8
    char field_6AC[4];           // 0x06AC
    char field_6B0[4];           // 0x06B0
    char field_6B4[4];           // 0x06B4
    char field_6B8[4];           // 0x06B8
    char field_6BC[4];           // 0x06BC
    char field_6C0[4];           // 0x06C0
    char field_6C4[4];           // 0x06C4
    char field_6C8[4];           // 0x06C8
    char field_6CC[4];           // 0x06CC
    char field_6D0[4];           // 0x06D0
    char field_6D4[4];           // 0x06D4
    char field_6D8[4];           // 0x06D8
    char field_6DC[4];           // 0x06DC
    char field_6E0[4];           // 0x06E0
    char field_6E4[4];           // 0x06E4
    char field_6E8[4];           // 0x06E8
    char field_6EC[4];           // 0x06EC
    char field_6F0[4];           // 0x06F0
    char field_6F4[4];           // 0x06F4
    char field_6F8[4];           // 0x06F8
    char field_6FC[4];           // 0x06FC
    char field_700[4];           // 0x0700
    char field_704[4];           // 0x0704
    char field_708[4];           // 0x0708
    char field_70C[4];           // 0x070C
    char field_710[4];           // 0x0710
    char field_714[4];           // 0x0714
    char field_718[4];           // 0x0718
    char field_71C[4];           // 0x071C
    char field_720[4];           // 0x0720
    char field_724[4];           // 0x0724
    char field_728[4];           // 0x0728
    char field_72C[4];           // 0x072C
    char field_730[4];           // 0x0730
    char field_734[4];           // 0x0734
    char field_738[4];           // 0x0738
    char field_73C[4];           // 0x073C
    char field_740[4];           // 0x0740
    char field_744[4];           // 0x0744
    char field_748[4];           // 0x0748
    char field_74C[4];           // 0x074C
    char field_750[4];           // 0x0750
    char field_754[4];           // 0x0754
    char field_758[4];           // 0x0758
    char field_75C[4];           // 0x075C
    char field_760[4];           // 0x0760
    char field_764[4];           // 0x0764
    char field_768[4];           // 0x0768
    char field_76C[4];           // 0x076C
    char field_770[4];           // 0x0770
    char field_774[4];           // 0x0774
    char field_778[4];           // 0x0778
    char field_77C[4];           // 0x077C
    char field_780[4];           // 0x0780
    char field_784[4];           // 0x0784
    char field_788[4];           // 0x0788
    char field_78C[4];           // 0x078C
    char field_790[4];           // 0x0790
    char field_794[4];           // 0x0794
    char field_798[4];           // 0x0798
    char field_79C[4];           // 0x079C
    char field_7A0[4];           // 0x07A0
    char field_7A4[4];           // 0x07A4
    char field_7A8[4];           // 0x07A8
    char field_7AC[4];           // 0x07AC
    char field_7B0[4];           // 0x07B0
    char field_7B4[4];           // 0x07B4
    char field_7B8[4];           // 0x07B8
    char field_7BC[4];           // 0x07BC
    char field_7C0[4];           // 0x07C0
    char field_7C4[4];           // 0x07C4
    char field_7C8[4];           // 0x07C8
    char field_7CC[4];           // 0x07CC
    char field_7D0[4];           // 0x07D0
    char field_7D4[4];           // 0x07D4
    char field_7D8[4];           // 0x07D8
    char field_7DC[4];           // 0x07DC
    char field_7E0[4];           // 0x07E0
    char field_7E4[4];           // 0x07E4
    char field_7E8[4];           // 0x07E8
    char field_7EC[4];           // 0x07EC
    char field_7F0[4];           // 0x07F0
    char field_7F4[4];           // 0x07F4
    char field_7F8[4];           // 0x07F8
    char field_7FC[4];           // 0x07FC
    char field_800[4];           // 0x0800
    char field_804[4];           // 0x0804
    char field_808[4];           // 0x0808
    char field_80C[4];           // 0x080C
    char field_810[4];           // 0x0810
    char field_814[4];           // 0x0814
    char field_818[4];           // 0x0818
    char field_81C[4];           // 0x081C
    char field_820[4];           // 0x0820
    char field_824[4];           // 0x0824
    char field_828[4];           // 0x0828
    char field_82C[4];           // 0x082C
    char field_830[4];           // 0x0830
    char field_834[4];           // 0x0834
    char field_838[4];           // 0x0838
    char field_83C[4];           // 0x083C
    char field_840[4];           // 0x0840
    char field_844[4];           // 0x0844
    char field_848[4];           // 0x0848
    char field_84C[4];           // 0x084C
    char field_850[4];           // 0x0850
    char field_854[4];           // 0x0854
    char field_858[4];           // 0x0858
    char field_85C[4];           // 0x085C
    char field_860[4];           // 0x0860
    char field_864[4];           // 0x0864
    char field_868[4];           // 0x0868
    char field_86C[4];           // 0x086C
    char field_870[4];           // 0x0870
    char field_874[4];           // 0x0874
    char field_878[4];           // 0x0878
    char field_87C[4];           // 0x087C
    char field_880[4];           // 0x0880
    char field_884[4];           // 0x0884
    char field_888[4];           // 0x0888
    char field_88C[4];           // 0x088C
    char field_890[4];           // 0x0890
    char field_894[4];           // 0x0894
    char field_898[4];           // 0x0898
    char field_89C[4];           // 0x089C
    char field_8A0[4];           // 0x08A0
    char field_8A4[4];           // 0x08A4
    char field_8A8[4];           // 0x08A8
    char field_8AC[4];           // 0x08AC
    char field_8B0[4];           // 0x08B0
    char field_8B4[4];           // 0x08B4
    char field_8B8[4];           // 0x08B8
    char field_8BC[4];           // 0x08BC
    char field_8C0[4];           // 0x08C0
    char field_8C4[4];           // 0x08C4
    char field_8C8[4];           // 0x08C8
    char field_8CC[4];           // 0x08CC
    char field_8D0[4];           // 0x08D0
    char field_8D4[4];           // 0x08D4
    char field_8D8[4];           // 0x08D8
    char field_8DC[4];           // 0x08DC
    char field_8E0[4];           // 0x08E0
    char field_8E4[4];           // 0x08E4
    char field_8E8[4];           // 0x08E8
    char field_8EC[4];           // 0x08EC
    char field_8F0[4];           // 0x08F0
    char field_8F4[4];           // 0x08F4
    char field_8F8[4];           // 0x08F8
    char field_8FC[4];           // 0x08FC
    char field_900[4];           // 0x0900
    char field_904[4];           // 0x0904
    char field_908[4];           // 0x0908
    char field_90C[4];           // 0x090C
    char field_910[4];           // 0x0910
    char field_914[4];           // 0x0914
    char field_918[4];           // 0x0918
    char field_91C[4];           // 0x091C
    char field_920[4];           // 0x0920
    char field_924[4];           // 0x0924
    char field_928[4];           // 0x0928
    char field_92C[4];           // 0x092C
    char field_930[4];           // 0x0930
    char field_934[4];           // 0x0934
    char field_938[4];           // 0x0938
    char field_93C[4];           // 0x093C
    char field_940[4];           // 0x0940
    char field_944[4];           // 0x0944
    char field_948[4];           // 0x0948
    char field_94C[4];           // 0x094C
    char field_950[4];           // 0x0950
    char field_954[4];           // 0x0954
    char field_958[4];           // 0x0958
    char field_95C[4];           // 0x095C
    char field_960[4];           // 0x0960
    char field_964[4];           // 0x0964
    char field_968[4];           // 0x0968
    char field_96C[4];           // 0x096C
    char field_970[4];           // 0x0970
    char field_974[4];           // 0x0974
    char field_978[4];           // 0x0978
    char field_97C[4];           // 0x097C
    char field_980[4];           // 0x0980
    char field_984[4];           // 0x0984
    char field_988[4];           // 0x0988
    char field_98C[4];           // 0x098C
    char field_990[4];           // 0x0990
    char field_994[4];           // 0x0994
    char field_998[4];           // 0x0998
    char field_99C[4];           // 0x099C
    char field_9A0[4];           // 0x09A0
    char field_9A4[4];           // 0x09A4
    char field_9A8[4];           // 0x09A8
    char field_9AC[4];           // 0x09AC
    char field_9B0[4];           // 0x09B0
    char field_9B4[4];           // 0x09B4
    char field_9B8[4];           // 0x09B8
    char field_9BC[4];           // 0x09BC
    char field_9C0[4];           // 0x09C0
    char field_9C4[4];           // 0x09C4
    char field_9C8[4];           // 0x09C8
    char field_9CC[4];           // 0x09CC
    char field_9D0[4];           // 0x09D0
    char field_9D4[4];           // 0x09D4
    char field_9D8[4];           // 0x09D8
    char field_9DC[4];           // 0x09DC
    char field_9E0[4];           // 0x09E0
    char field_9E4[4];           // 0x09E4
    char field_9E8[4];           // 0x09E8
    char field_9EC[4];           // 0x09EC
    char field_9F0[4];           // 0x09F0
    char field_9F4[4];           // 0x09F4
    char field_9F8[4];           // 0x09F8
    char field_9FC[4];           // 0x09FC
    char field_A00[4];           // 0x0A00
    char field_A04[4];           // 0x0A04
    char field_A08[4];           // 0x0A08
    char field_A0C[4];           // 0x0A0C
    char field_A10[4];           // 0x0A10
    char field_A14[4];           // 0x0A14
    char field_A18[4];           // 0x0A18
    char field_A1C[4];           // 0x0A1C
    char field_A20[4];           // 0x0A20
    char field_A24[4];           // 0x0A24
    char field_A28[4];           // 0x0A28
    char field_A2C[4];           // 0x0A2C
    char field_A30[4];           // 0x0A30
    char field_A34[4];           // 0x0A34
    char field_A38[4];           // 0x0A38
    char field_A3C[4];           // 0x0A3C
    char field_A40[4];           // 0x0A40
    char field_A44[4];           // 0x0A44
    char field_A48[4];           // 0x0A48
    char field_A4C[4];           // 0x0A4C
    char field_A50[4];           // 0x0A50
    char field_A54[4];           // 0x0A54
    char field_A58[4];           // 0x0A58
    char field_A5C[4];           // 0x0A5C
    char field_A60[4];           // 0x0A60
    char field_A64[4];           // 0x0A64
    char field_A68[4];           // 0x0A68
    char field_A6C[4];           // 0x0A6C
    char field_A70[4];           // 0x0A70
    char field_A74[4];           // 0x0A74
    char field_A78[4];           // 0x0A78
    char field_A7C[4];           // 0x0A7C
    char field_A80[4];           // 0x0A80
    char field_A84[4];           // 0x0A84
    char field_A88[4];           // 0x0A88
    char field_A8C[4];           // 0x0A8C
    char field_A90[4];           // 0x0A90
    char field_A94[4];           // 0x0A94
    char field_A98[4];           // 0x0A98
    char field_A9C[4];           // 0x0A9C
    char field_AA0[4];           // 0x0AA0
    char field_AA4[4];           // 0x0AA4
    char field_AA8[4];           // 0x0AA8
    char field_AAC[4];           // 0x0AAC
    char field_AB0[4];           // 0x0AB0
    char field_AB4[4];           // 0x0AB4
    char field_AB8[4];           // 0x0AB8
    char field_ABC[4];           // 0x0ABC
    char field_AC0[4];           // 0x0AC0
    char field_AC4[4];           // 0x0AC4
    char field_AC8[4];           // 0x0AC8
    char field_ACC[4];           // 0x0ACC
    char field_AD0[4];           // 0x0AD0
    char field_AD4[4];           // 0x0AD4
    char field_AD8[4];           // 0x0AD8
    char field_ADC[4];           // 0x0ADC
    char field_AE0[4];           // 0x0AE0
    char field_AE4[4];           // 0x0AE4
    char field_AE8[4];           // 0x0AE8
    char field_AEC[4];           // 0x0AEC
    char field_AF0[4];           // 0x0AF0
    char field_AF4[4];           // 0x0AF4
    char field_AF8[4];           // 0x0AF8
    char field_AFC[4];           // 0x0AFC
    char field_B00[4];           // 0x0B00
    char field_B04[4];           // 0x0B04
    char field_B08[4];           // 0x0B08
    char field_B0C[4];           // 0x0B0C
    char field_B10[4];           // 0x0B10
    char field_B14[4];           // 0x0B14
    char field_B18[4];           // 0x0B18
    char field_B1C[4];           // 0x0B1C
    char field_B20[4];           // 0x0B20
    char field_B24[4];           // 0x0B24
    char field_B28[4];           // 0x0B28
    char field_B2C[4];           // 0x0B2C
    char field_B30[4];           // 0x0B30
    char field_B34[4];           // 0x0B34
    char field_B38[4];           // 0x0B38
    char field_B3C[4];           // 0x0B3C
    char field_B40[4];           // 0x0B40
    char field_B44[4];           // 0x0B44
    char field_B48[4];           // 0x0B48
    char field_B4C[4];           // 0x0B4C
    char field_B50[4];           // 0x0B50
    char field_B54[4];           // 0x0B54
    char field_B58[4];           // 0x0B58
    char field_B5C[4];           // 0x0B5C
    char field_B60[4];           // 0x0B60
    char field_B64[4];           // 0x0B64
    char field_B68[4];           // 0x0B68
    char field_B6C[4];           // 0x0B6C
    char field_B70[4];           // 0x0B70
    char field_B74[4];           // 0x0B74
    char field_B78[4];           // 0x0B78
    char field_B7C[4];           // 0x0B7C
    char field_B80[4];           // 0x0B80
    char field_B84[4];           // 0x0B84
    char field_B88[4];           // 0x0B88
    char field_B8C[4];           // 0x0B8C
    char field_B90[4];           // 0x0B90
    char field_B94[4];           // 0x0B94
    char field_B98[4];           // 0x0B98
    char field_B9C[4];           // 0x0B9C
    char field_BA0[4];           // 0x0BA0
    char field_BA4[4];           // 0x0BA4
    char field_BA8[4];           // 0x0BA8
    char field_BAC[4];           // 0x0BAC
    char field_BB0[4];           // 0x0BB0
    char field_BB4[4];           // 0x0BB4
    char field_BB8[4];           // 0x0BB8
    char field_BBC[4];           // 0x0BBC
    char field_BC0[4];           // 0x0BC0
    char field_BC4[4];           // 0x0BC4
    char field_BC8[4];           // 0x0BC8
    char field_BCC[4];           // 0x0BCC
    char field_BD0[4];           // 0x0BD0
    char field_BD4[4];           // 0x0BD4
    char field_BD8[4];           // 0x0BD8
    char field_BDC[4];           // 0x0BDC
    char field_BE0[4];           // 0x0BE0
    char field_BE4[4];           // 0x0BE4
    char field_BE8[4];           // 0x0BE8
    char field_BEC[4];           // 0x0BEC
    char field_BF0[4];           // 0x0BF0
    char field_BF4[4];           // 0x0BF4
    char field_BF8[4];           // 0x0BF8
    char field_BFC[4];           // 0x0BFC
    char field_C00[4];           // 0x0C00
    char field_C04[4];           // 0x0C04
    char field_C08[4];           // 0x0C08
    char field_C0C[4];           // 0x0C0C
    char field_C10[4];           // 0x0C10
    char field_C14[4];           // 0x0C14
    char field_C18[4];           // 0x0C18
    char field_C1C[4];           // 0x0C1C
    char field_C20[4];           // 0x0C20
    char field_C24[4];           // 0x0C24
    char field_C28[4];           // 0x0C28
    char field_C2C[4];           // 0x0C2C
    char field_C30[4];           // 0x0C30
    char field_C34[4];           // 0x0C34
    char field_C38[4];           // 0x0C38
    char field_C3C[4];           // 0x0C3C
    char field_C40[4];           // 0x0C40
    char field_C44[4];           // 0x0C44
    char field_C48[4];           // 0x0C48
    char field_C4C[4];           // 0x0C4C
    char field_C50[4];           // 0x0C50
    char field_C54[4];           // 0x0C54
    char field_C58[4];           // 0x0C58
    char field_C5C[4];           // 0x0C5C
    char field_C60[4];           // 0x0C60
    char field_C64[4];           // 0x0C64
    char field_C68[4];           // 0x0C68
    char field_C6C[4];           // 0x0C6C
    char field_C70[4];           // 0x0C70
    char field_C74[4];           // 0x0C74
    char field_C78[4];           // 0x0C78
    char field_C7C[4];           // 0x0C7C
    char field_C80[4];           // 0x0C80
    char field_C84[4];           // 0x0C84
    char field_C88[4];           // 0x0C88
    char field_C8C[4];           // 0x0C8C
    char field_C90[4];           // 0x0C90
    char field_C94[4];           // 0x0C94
    char field_C98[4];           // 0x0C98
    char field_C9C[4];           // 0x0C9C
    char field_CA0[4];           // 0x0CA0
    char field_CA4[4];           // 0x0CA4
    char field_CA8[4];           // 0x0CA8
    char field_CAC[4];           // 0x0CAC
    char field_CB0[4];           // 0x0CB0
    char field_CB4[4];           // 0x0CB4
    char field_CB8[4];           // 0x0CB8
    char field_CBC[4];           // 0x0CBC
    char field_CC0[4];           // 0x0CC0
    char field_CC4[4];           // 0x0CC4
    char field_CC8[4];           // 0x0CC8
    char field_CCC[4];           // 0x0CCC
    char field_CD0[4];           // 0x0CD0
    char field_CD4[4];           // 0x0CD4
    char field_CD8[4];           // 0x0CD8
    char field_CDC[4];           // 0x0CDC
    char field_CE0[4];           // 0x0CE0
    char field_CE4[4];           // 0x0CE4
    char field_CE8[4];           // 0x0CE8
    char field_CEC[4];           // 0x0CEC
    char field_CF0[4];           // 0x0CF0
    char field_CF4[4];           // 0x0CF4
    char field_CF8[4];           // 0x0CF8
    char field_CFC[4];           // 0x0CFC
    char field_D00[4];           // 0x0D00
    char field_D04[4];           // 0x0D04
    char field_D08[4];           // 0x0D08
    char field_D0C[4];           // 0x0D0C
    char field_D10[4];           // 0x0D10
    char field_D14[4];           // 0x0D14
    char field_D18[4];           // 0x0D18
    char field_D1C[4];           // 0x0D1C
    char field_D20[4];           // 0x0D20
    char field_D24[4];           // 0x0D24
    char field_D28[4];           // 0x0D28
    char field_D2C[4];           // 0x0D2C
    char field_D30[4];           // 0x0D30
    char field_D34[4];           // 0x0D34
    char field_D38[4];           // 0x0D38
    char field_D3C[4];           // 0x0D3C
    char field_D40[4];           // 0x0D40
    char field_D44[4];           // 0x0D44
    char field_D48[4];           // 0x0D48
    char field_D4C[4];           // 0x0D4C
    char field_D50[4];           // 0x0D50
    char field_D54[4];           // 0x0D54
    char field_D58[4];           // 0x0D58
    char field_D5C[4];           // 0x0D5C
    char field_D60[4];           // 0x0D60
    char field_D64[4];           // 0x0D64
    char field_D68[4];           // 0x0D68
    char field_D6C[4];           // 0x0D6C
    char field_D70[4];           // 0x0D70
    char field_D74[4];           // 0x0D74
    char field_D78[4];           // 0x0D78
    char field_D7C[4];           // 0x0D7C
    char field_D80[4];           // 0x0D80
    char field_D84[4];           // 0x0D84
    char field_D88[4];           // 0x0D88
    char field_D8C[4];           // 0x0D8C
    char field_D90[4];           // 0x0D90
    char field_D94[4];           // 0x0D94
    char field_D98[4];           // 0x0D98
    char field_D9C[4];           // 0x0D9C
    char field_DA0[4];           // 0x0DA0
    char field_DA4[4];           // 0x0DA4
    char field_DA8[4];           // 0x0DA8
    char field_DAC[4];           // 0x0DAC
    char field_DB0[4];           // 0x0DB0
    char field_DB4[4];           // 0x0DB4
    char field_DB8[4];           // 0x0DB8
    char field_DBC[4];           // 0x0DBC
    char field_DC0[4];           // 0x0DC0
    char field_DC4[4];           // 0x0DC4
    char field_DC8[4];           // 0x0DC8
    char field_DCC[4];           // 0x0DCC
    char field_DD0[4];           // 0x0DD0
    char field_DD4[4];           // 0x0DD4
    char field_DD8[4];           // 0x0DD8
    char field_DDC[4];           // 0x0DDC
    char field_DE0[4];           // 0x0DE0
    char field_DE4[4];           // 0x0DE4
    char field_DE8[4];           // 0x0DE8
    char field_DEC[4];           // 0x0DEC
    char field_DF0[4];           // 0x0DF0
    char field_DF4[4];           // 0x0DF4
    char field_DF8[4];           // 0x0DF8
    char field_DFC[4];           // 0x0DFC
    char field_E00[4];           // 0x0E00
    char field_E04[4];           // 0x0E04
    char field_E08[4];           // 0x0E08
    char field_E0C[4];           // 0x0E0C
    char field_E10[4];           // 0x0E10
    char field_E14[4];           // 0x0E14
    char field_E18[4];           // 0x0E18
    char field_E1C[4];           // 0x0E1C
    char field_E20[4];           // 0x0E20
    char field_E24[4];           // 0x0E24
    char field_E28[4];           // 0x0E28
    char field_E2C[4];           // 0x0E2C
    char field_E30[4];           // 0x0E30
    char field_E34[4];           // 0x0E34
    char field_E38[4];           // 0x0E38
    char field_E3C[4];           // 0x0E3C
    char field_E40[4];           // 0x0E40
    char field_E44[4];           // 0x0E44
    char field_E48[4];           // 0x0E48
    char field_E4C[4];           // 0x0E4C
    char field_E50[4];           // 0x0E50
    char field_E54[4];           // 0x0E54
    char field_E58[4];           // 0x0E58
    char field_E5C[4];           // 0x0E5C
    char field_E60[4];           // 0x0E60
    char field_E64[4];           // 0x0E64
    char field_E68[4];           // 0x0E68
    char field_E6C[4];           // 0x0E6C
    char field_E70[4];           // 0x0E70
    char field_E74[4];           // 0x0E74
    char field_E78[4];           // 0x0E78
    char field_E7C[4];           // 0x0E7C
    char field_E80[4];           // 0x0E80
    char field_E84[4];           // 0x0E84
    char field_E88[4];           // 0x0E88
    char field_E8C[4];           // 0x0E8C
    char field_E90[4];           // 0x0E90
    char field_E94[4];           // 0x0E94
    char field_E98[4];           // 0x0E98
    char field_E9C[4];           // 0x0E9C
    char field_EA0[4];           // 0x0EA0
    char field_EA4[4];           // 0x0EA4
    char field_EA8[4];           // 0x0EA8
    char field_EAC[4];           // 0x0EAC
    char field_EB0[4];           // 0x0EB0
    char field_EB4[4];           // 0x0EB4
    char field_EB8[4];           // 0x0EB8
    char field_EBC[4];           // 0x0EBC
    char field_EC0[4];           // 0x0EC0
    char field_EC4[4];           // 0x0EC4
    char field_EC8[4];           // 0x0EC8
    char field_ECC[4];           // 0x0ECC
    char field_ED0[4];           // 0x0ED0
    char field_ED4[4];           // 0x0ED4
    char field_ED8[4];           // 0x0ED8
    char field_EDC[4];           // 0x0EDC
    char field_EE0[4];           // 0x0EE0
    char field_EE4[4];           // 0x0EE4
    char field_EE8[4];           // 0x0EE8
    char field_EEC[4];           // 0x0EEC
    char field_EF0[4];           // 0x0EF0
    char field_EF4[4];           // 0x0EF4
    char field_EF8[4];           // 0x0EF8
    char field_EFC[4];           // 0x0EFC
    char field_F00[4];           // 0x0F00
    char field_F04[4];           // 0x0F04
    char field_F08[4];           // 0x0F08
    char field_F0C[4];           // 0x0F0C
    char field_F10[4];           // 0x0F10
    char field_F14[4];           // 0x0F14
    char field_F18[4];           // 0x0F18
    char field_F1C[4];           // 0x0F1C
    char field_F20[4];           // 0x0F20
    char field_F24[4];           // 0x0F24
    char field_F28[4];           // 0x0F28
    char field_F2C[4];           // 0x0F2C
    char field_F30[4];           // 0x0F30
    char field_F34[4];           // 0x0F34
    char field_F38[4];           // 0x0F38
    char field_F3C[4];           // 0x0F3C
    char field_F40[4];           // 0x0F40
    char field_F44[4];           // 0x0F44
    char field_F48[4];           // 0x0F48
    char field_F4C[4];           // 0x0F4C
    char field_F50[4];           // 0x0F50
    char field_F54[4];           // 0x0F54
    char field_F58[4];           // 0x0F58
    char field_F5C[4];           // 0x0F5C
    char field_F60[4];           // 0x0F60
    char field_F64[4];           // 0x0F64
    char field_F68[4];           // 0x0F68
    char field_F6C[4];           // 0x0F6C
    char field_F70[4];           // 0x0F70
    char field_F74[4];           // 0x0F74
    char field_F78[4];           // 0x0F78
    char field_F7C[4];           // 0x0F7C
    char field_F80[4];           // 0x0F80
    char field_F84[4];           // 0x0F84
    char field_F88[4];           // 0x0F88
    char field_F8C[4];           // 0x0F8C
    char field_F90[4];           // 0x0F90
    char field_F94[4];           // 0x0F94
    char field_F98[4];           // 0x0F98
    char field_F9C[4];           // 0x0F9C
    char field_FA0[4];           // 0x0FA0
    char field_FA4[4];           // 0x0FA4
    char field_FA8[4];           // 0x0FA8
    char field_FAC[4];           // 0x0FAC
    char field_FB0[4];           // 0x0FB0
    char field_FB4[4];           // 0x0FB4
    char field_FB8[4];           // 0x0FB8
    char field_FBC[4];           // 0x0FBC
    char field_FC0[4];           // 0x0FC0
    char field_FC4[4];           // 0x0FC4
    char field_FC8[4];           // 0x0FC8
    char field_FCC[4];           // 0x0FCC
    char field_FD0[4];           // 0x0FD0
    char field_FD4[4];           // 0x0FD4
    char field_FD8[4];           // 0x0FD8
    char field_FDC[4];           // 0x0FDC
    char field_FE0[4];           // 0x0FE0
    char field_FE4[4];           // 0x0FE4
    char field_FE8[4];           // 0x0FE8
    char field_FEC[4];           // 0x0FEC
    char field_FF0[4];           // 0x0FF0
    char field_FF4[4];           // 0x0FF4
    char field_FF8[4];           // 0x0FF8
    char field_FFC[4];           // 0x0FFC
    // Конец структуры (смещение 0x1000 = 4096 байт)
};

#pragma pack(pop)

// Проверка размера структуры (должен быть 4096 байт при упаковке 1)
static_assert(sizeof(Ped) == 0x1000, "Размер структуры Ped должен быть 0x1000 (4096) байт");

#endif // PED_H
